Python 3.6.7 (v3.6.7:6ec5cf24b7, Oct 20 2018, 13:35:33) [MSC v.1900 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
======== RESTART: A:\Arima\PROJECTS\CNN\New folder\M_C_F_D_P._2py.py ========
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 148, 148, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 74, 74, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 72, 72, 64)        18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 34, 34, 64)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 17, 17, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 15, 32)        18464     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 5, 32)          9248      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 512)               66048     
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 1026      
=================================================================
Total params: 151,106
Trainable params: 151,106
Non-trainable params: 0
_________________________________________________________________
(TensorSpec(shape=(None, 150, 150, 3), dtype=tf.float32, name=None), TensorSpec(shape=(None, 2), dtype=tf.float32, name=None))
Found 2454 images belonging to 2 classes.
  1/100 [..............................] - ETA: 1:22 - loss: 0.1263 - acc: 1.0000  2/100 [..............................] - ETA: 20s - loss: 0.1167 - acc: 1.0000   3/100 [..............................] - ETA: 21s - loss: 0.1921 - acc: 0.9667  4/100 [>.............................] - ETA: 22s - loss: 0.1808 - acc: 0.9750  5/100 [>.............................] - ETA: 23s - loss: 0.2198 - acc: 0.9400  6/100 [>.............................] - ETA: 22s - loss: 0.2027 - acc: 0.9500  7/100 [=>............................] - ETA: 22s - loss: 0.2157 - acc: 0.9429  8/100 [=>............................] - ETA: 23s - loss: 0.2366 - acc: 0.9375  9/100 [=>............................] - ETA: 23s - loss: 0.2301 - acc: 0.9333 10/100 [==>...........................] - ETA: 23s - loss: 0.2184 - acc: 0.9400 11/100 [==>...........................] - ETA: 23s - loss: 0.2202 - acc: 0.9364 12/100 [==>...........................] - ETA: 23s - loss: 0.2173 - acc: 0.9333 13/100 [==>...........................] - ETA: 23s - loss: 0.2071 - acc: 0.9385 14/100 [===>..........................] - ETA: 22s - loss: 0.1977 - acc: 0.9429 15/100 [===>..........................] - ETA: 22s - loss: 0.1898 - acc: 0.9467 16/100 [===>..........................] - ETA: 23s - loss: 0.2061 - acc: 0.9375 17/100 [====>.........................] - ETA: 23s - loss: 0.1977 - acc: 0.9412 18/100 [====>.........................] - ETA: 23s - loss: 0.1955 - acc: 0.9444 19/100 [====>.........................] - ETA: 23s - loss: 0.1956 - acc: 0.9421 20/100 [=====>........................] - ETA: 23s - loss: 0.1887 - acc: 0.9450 21/100 [=====>........................] - ETA: 23s - loss: 0.1978 - acc: 0.9429 22/100 [=====>........................] - ETA: 23s - loss: 0.1968 - acc: 0.9409 23/100 [=====>........................] - ETA: 23s - loss: 0.1988 - acc: 0.9391 24/100 [======>.......................] - ETA: 23s - loss: 0.1960 - acc: 0.9375 25/100 [======>.......................] - ETA: 23s - loss: 0.1973 - acc: 0.9320 26/100 [======>.......................] - ETA: 23s - loss: 0.1922 - acc: 0.9346 27/100 [=======>......................] - ETA: 23s - loss: 0.1910 - acc: 0.9370 28/100 [=======>......................] - ETA: 23s - loss: 0.1909 - acc: 0.9357 29/100 [=======>......................] - ETA: 23s - loss: 0.1886 - acc: 0.9379 30/100 [========>.....................] - ETA: 23s - loss: 0.1928 - acc: 0.9333 31/100 [========>.....................] - ETA: 23s - loss: 0.1983 - acc: 0.9323 32/100 [========>.....................] - ETA: 22s - loss: 0.1982 - acc: 0.9312 33/100 [========>.....................] - ETA: 22s - loss: 0.1981 - acc: 0.9303 34/100 [=========>....................] - ETA: 22s - loss: 0.1986 - acc: 0.9294 35/100 [=========>....................] - ETA: 22s - loss: 0.1957 - acc: 0.9314 36/100 [=========>....................] - ETA: 22s - loss: 0.1916 - acc: 0.9333 37/100 [==========>...................] - ETA: 22s - loss: 0.1931 - acc: 0.9324 38/100 [==========>...................] - ETA: 22s - loss: 0.1964 - acc: 0.9316 39/100 [==========>...................] - ETA: 22s - loss: 0.2021 - acc: 0.9282 40/100 [===========>..................] - ETA: 22s - loss: 0.2039 - acc: 0.9275 41/100 [===========>..................] - ETA: 22s - loss: 0.2027 - acc: 0.9268 42/100 [===========>..................] - ETA: 21s - loss: 0.2015 - acc: 0.9286 43/100 [===========>..................] - ETA: 21s - loss: 0.2012 - acc: 0.9279 44/100 [============>.................] - ETA: 21s - loss: 0.1986 - acc: 0.9295 45/100 [============>.................] - ETA: 21s - loss: 0.1953 - acc: 0.9311 46/100 [============>.................] - ETA: 21s - loss: 0.1985 - acc: 0.9283 47/100 [=============>................] - ETA: 21s - loss: 0.1964 - acc: 0.9298 48/100 [=============>................] - ETA: 20s - loss: 0.2018 - acc: 0.9250 49/100 [=============>................] - ETA: 20s - loss: 0.2007 - acc: 0.9245 50/100 [==============>...............] - ETA: 20s - loss: 0.2012 - acc: 0.9240 51/100 [==============>...............] - ETA: 20s - loss: 0.2005 - acc: 0.9235 52/100 [==============>...............] - ETA: 19s - loss: 0.1990 - acc: 0.9250 53/100 [==============>...............] - ETA: 19s - loss: 0.2017 - acc: 0.9245 54/100 [===============>..............] - ETA: 19s - loss: 0.1997 - acc: 0.9259 55/100 [===============>..............] - ETA: 19s - loss: 0.1976 - acc: 0.9273 56/100 [===============>..............] - ETA: 18s - loss: 0.1974 - acc: 0.9268 57/100 [================>.............] - ETA: 18s - loss: 0.1979 - acc: 0.9263 58/100 [================>.............] - ETA: 18s - loss: 0.1960 - acc: 0.9276 59/100 [================>.............] - ETA: 18s - loss: 0.1972 - acc: 0.9271 60/100 [=================>............] - ETA: 17s - loss: 0.2005 - acc: 0.9250 61/100 [=================>............] - ETA: 17s - loss: 0.2005 - acc: 0.9246 62/100 [=================>............] - ETA: 17s - loss: 0.1993 - acc: 0.9258 63/100 [=================>............] - ETA: 17s - loss: 0.2030 - acc: 0.9254 64/100 [==================>...........] - ETA: 16s - loss: 0.2087 - acc: 0.9234 65/100 [==================>...........] - ETA: 16s - loss: 0.2080 - acc: 0.9231 66/100 [==================>...........] - ETA: 16s - loss: 0.2116 - acc: 0.9212 67/100 [===================>..........] - ETA: 15s - loss: 0.2101 - acc: 0.9224 68/100 [===================>..........] - ETA: 15s - loss: 0.2098 - acc: 0.9221 69/100 [===================>..........] - ETA: 15s - loss: 0.2125 - acc: 0.9217 70/100 [====================>.........] - ETA: 14s - loss: 0.2144 - acc: 0.9200 71/100 [====================>.........] - ETA: 14s - loss: 0.2173 - acc: 0.9183 72/100 [====================>.........] - ETA: 14s - loss: 0.2225 - acc: 0.9153 73/100 [====================>.........] - ETA: 13s - loss: 0.2243 - acc: 0.9151 74/100 [=====================>........] - ETA: 13s - loss: 0.2259 - acc: 0.9149 75/100 [=====================>........] - ETA: 12s - loss: 0.2241 - acc: 0.9160 76/100 [=====================>........] - ETA: 12s - loss: 0.2264 - acc: 0.9158 77/100 [======================>.......] - ETA: 12s - loss: 0.2338 - acc: 0.9117 78/100 [======================>.......] - ETA: 11s - loss: 0.2344 - acc: 0.9115 79/100 [======================>.......] - ETA: 11s - loss: 0.2354 - acc: 0.9114 80/100 [=======================>......] - ETA: 10s - loss: 0.2370 - acc: 0.9112 81/100 [=======================>......] - ETA: 10s - loss: 0.2417 - acc: 0.9086 82/100 [=======================>......] - ETA: 9s - loss: 0.2403 - acc: 0.9098  83/100 [=======================>......] - ETA: 9s - loss: 0.2397 - acc: 0.9096 84/100 [========================>.....] - ETA: 8s - loss: 0.2402 - acc: 0.9095 85/100 [========================>.....] - ETA: 8s - loss: 0.2455 - acc: 0.9071 86/100 [========================>.....] - ETA: 7s - loss: 0.2435 - acc: 0.9081 87/100 [=========================>....] - ETA: 7s - loss: 0.2416 - acc: 0.9092 88/100 [=========================>....] - ETA: 6s - loss: 0.2415 - acc: 0.9091 89/100 [=========================>....] - ETA: 6s - loss: 0.2411 - acc: 0.9090 90/100 [==========================>...] - ETA: 5s - loss: 0.2390 - acc: 0.9100 91/100 [==========================>...] - ETA: 5s - loss: 0.2395 - acc: 0.9099 92/100 [==========================>...] - ETA: 4s - loss: 0.2383 - acc: 0.9109 93/100 [==========================>...] - ETA: 4s - loss: 0.2392 - acc: 0.9108 94/100 [===========================>..] - ETA: 3s - loss: 0.2381 - acc: 0.9106 95/100 [===========================>..] - ETA: 3s - loss: 0.2372 - acc: 0.9105 96/100 [===========================>..] - ETA: 2s - loss: 0.2385 - acc: 0.9094 97/100 [============================>.] - ETA: 1s - loss: 0.2368 - acc: 0.9103 98/100 [============================>.] - ETA: 1s - loss: 0.2373 - acc: 0.9102 99/100 [============================>.] - ETA: 0s - loss: 0.2372 - acc: 0.9101100/100 [==============================] - ETA: 0s - loss: 0.2385 - acc: 0.9100100/100 [==============================] - 65s 653ms/step - loss: 0.2385 - acc: 0.9100
Loss: 0.23848195374011993 

 Accuracy 0.9100000262260437
D:/Test_C/2012.jfif
Cracked
D:/Test_C/download.jfif
Non-Cracked
D:/Test_C/Fix_cracks_in_garage_floor.jpg
Cracked
D:/Test_C/wall.jfif
Cracked
>>> 
